==================
boolean_expression
==================

lambda foo() => b + 8 * 9 and 101 > 0 < 19

---


========
negation
========

lambda foo() => not a or b

---

  (Module (declarations__list (NamedLambdaDeclaration (identifier (Identifier)) (expression (Expression (Negation (expression (Expression (BooleanExpression (left (Expression (PrimaryExpression (Identifier)))) (Disjunction) (right (Expression (PrimaryExpression (Identifier)))))))))))))

================
unary_expression
================

lambda foo() => -1+4

---

(Module (declarations__list (NamedLambdaDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (BinaryExpression (Addition (left (UnaryFactor (NegativeFactor (NegativeSign) (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral))))))) (right (Literal (NumberLiteral (IntegerLiteral))))))))))))


============
FunctionCall
============

lambda foo() => f(a)

---

(Module (declarations__list (NamedLambdaDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (CallOrAccess (expression (CallableName (Identifier))) (call_parameters__list (Expression (PrimaryExpression (Identifier)))))))))))

===========
ChainedCall
===========

lambda foo() => f(a).f(b)

---

 (Module (declarations__list (NamedLambdaDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (FluentCallOrAccess (expression (CallOrAccess (expression (CallableName (Identifier))) (call_parameters__list (Expression (PrimaryExpression (Identifier)))))) (call_identifier (Identifier)) (call_parameters__list (Expression (PrimaryExpression (Identifier)))))))))))

=========
Lambda OK
=========

lambda foo() => lambda () => 1

---

  (Module (declarations__list (NamedLambdaDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (Lambda (expression (Expression (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral)))))))))))))

