============================
lambda_declaration_statement
============================

function bar<A extends B | C, S extends D>(a: A) => "bar"

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (type_parameters (TypeParameters (type_parameters__list (TypeParameter (name (Identifier)) (constraint (Type (TypeUnion (types__list (TypeIdentifier (Identifier))) (types__list (TypeIdentifier (Identifier)))))))) (type_parameters__list (TypeParameter (name (Identifier)) (constraint (Type (TypeUnion (types__list (TypeIdentifier (Identifier)))))))))) (parameters__list (NamedLambdaParameter (identifier (Identifier)) (type (Type (TypeUnion (types__list (TypeIdentifier (Identifier)))))))) (expression (Expression (PrimaryExpression (Literal (StringLiteral))))))))

=================
lambda empty list
=================

function foo() => []

---

 (Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (List)))))))

============
lambda while
============

function foo() => () => while 2: 2
function foo() => while 2: 2

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (Lambda (WhileExpression (while_condition (Expression (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral)))))) (expression (Expression (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral))))))))))))) (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (WhileExpression (while_condition (Expression (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral)))))) (expression (Expression (PrimaryExpression (Literal (NumberLiteral (IntegerLiteral))))))))))

=======================
lambda callable literal
=======================

function foo(list: List) => list.'first_element'()

---

  (Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (parameters__list (NamedLambdaParameter (identifier (Identifier)) (type (Type (TypeUnion (types__list (TypeIdentifier (Identifier)))))))) (expression (Expression (PrimaryExpression (FluentCall (expression (Identifier)) (parenthesis_callee (Literal (StringLiteral))))))))))

===========================
lambda implicit parenthesis
===========================

function foo(list: List) => list.'first_element'

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (parameters__list (NamedLambdaParameter (identifier (Identifier)) (type (Type (TypeUnion (types__list (TypeIdentifier (Identifier)))))))) (expression (Expression (PrimaryExpression (FluentCall (expression (Identifier)) (parenthesis_callee (Literal (StringLiteral))))))))))
