==============================
function declaration statement
==============================

function bar<
    A extends B | C,
    S extends D
    >
(a: A) => "bar"

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (type_parameters (TypeParameters (type_parameters__list (TypeParameter (name (Identifier)) (constraint (Type (TypeUnion (types__list (TypeIdentifier (identifier))) (types__list (TypeIdentifier (identifier)))))))) (type_parameters__list (TypeParameter (name (Identifier)) (constraint (Type (TypeUnion (types__list (TypeIdentifier (identifier)))))))))) (parameters_list (identifier) (type_expression (TypeIdentifier (identifier)))) (expression (Expression (PrimaryExpression (Literal (StringLiteral))))))))

===================
function empty list
===================

function foo() => []

---

 (Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (expression (Expression (PrimaryExpression (List)))))))

=========================
function callable literal
=========================

function foo(list: List) => list.'first_element'()

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (parameters_list (identifier) (type_expression (TypeIdentifier (identifier)))) (expression (Expression (PrimaryExpression (FluentCall (expression (Identifier)) (parenthesis_callee (Literal (StringLiteral))))))))))

=============================
function implicit parenthesis
=============================

function foo(list: List) => list.'first_element'

---

(Module (declarations__list (NamedFunctionDeclaration (identifier (Identifier)) (parameters_list (identifier) (type_expression (TypeIdentifier (identifier)))) (expression (Expression (PrimaryExpression (FluentCall (expression (Identifier)) (parenthesis_callee (Literal (StringLiteral))))))))))

=========================
ParameterizedFunctionType
=========================

function foo(list: (L) => List) => [list]

---



